app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "phone", "cpf", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

SELECT "users".* FROM "users" WHERE "users"."email" = ?  [["email", "lopes@aquino.com"]]
SELECT "users".* FROM "users" WHERE "users"."name" = ?  [["name", "nicolas"]]
SELECT "users".* FROM "users" WHERE "users"."cpf" = ?  [["cpf", "117.710.624-05"]]
SELECT "users".* FROM "users" WHERE "users"."phone" = ?  [["phone", "84986364127"]]
---
  def resultados_pesquisa
    criteria = params[:criteria]
    query = params[:query]

    if query.present?
      if criteria == 'email'
        @users = User.where(email: query)
      elsif criteria == 'name'
        @users = User.where(name: query)
      elsif criteria == 'cpf'
        @users = User.where(cpf: query)
      elsif criteria == 'phone'
        @users = User.where(phone: query)

SELECT "users"."name", "users"."email", "users"."phone", "users"."cpf" FROM "users"
---
def select_fields
  @users = User.select(:name, :email, :phone, :cpf)

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]
---
  def destroy
    @user.destroy!